/*
    第5章 指针、数组和结构
    5.1 指针
        ...

    5.2 数组
        ...

    5.3 到数组的指针
        ...

    5.4 常量
        ...
    
    5.5 引用
        一个引用就是某对象的另一个名字.引用的主要用途是为了描述函数的参数和返回值,
        特别是为了运算符的重载(第11章).记法X&表示到X的引用.例如,
        (个人扩展理解:int i = 5; i这个标识符是否可以理解为本质上就是一个对象的"引用"呢?还是别自作
                    聪明,i就为对象本身...;
                    int &ri = i; ri标识符与&(原意为取址运算符)结合,整个对象为指针,因此ri为
                    被取址的对象,&ri对象与int结合,为指向int类型值的指针,因此ri对象为int类型
                    值的引用(它不是int类型对象本身);
                    i为左值,虽然i在=赋值运算符的右边;赋值给引用的变量必须已经初始化,即已分配地址,并知
                    道类型<即存储空间长度,c和c++为强类型语言>)
        
        ...
        ...

    5.6 指向void的指针
        ...

    5.7 结构
        ...

    5.8 忠告
        ...


*/