/**
 * 第7章 进程调度：介绍
 * 
 *    现在，运行进程的底层机制（mechanism）（如上下文切换）应该清楚了。如果还不清
 * 楚，请往回翻一两章，再次阅读这些工作原理的描述。然而，我们还不知道操作系统调度
 * 程序采用的上层策略（policy）。接下来会介绍一系列的调度策略（scheduling policy，有时称
 * 为discipline），它们是许多聪明又努力的人在过去这些年里开发的。
 *    事实上，调度的起源早于计算机系统。早期调度策略取自于操作管理领域，并应用于
 * 计算机。...
 * ...
 *                         关键问题：如何开发调度策略
 *    我们该如何开发一个考虑调度策略的基本框架？什么是关键假设？哪些指标非常重要？哪些基本
 * 方法已经在早期的系统中使用？
 * 
 * 7.1 工作负载假设
 *    探讨可能的策略范围之前，我们先做一些简化假设。这些假设与系统中运行的进程有
 * 关，有时候统称为工作负载（workload）。确定工作负载是构建调度策略的关键部分。工作
 * 负载了解得越多，你的策略就越优化。
 *    ...
 * 
 * ...
 * 
 * 
 * 
 * 7.7 轮转
 * 
 * 
 * 
 * 
 * 
 * 
 * 
*/